Revit 2026 API

# ACAObjectPreference Enumeration

---

An enumerated type listing possible ways to generate geometry of an ACA object Revit object parameters used to generate geometry of the exported ACA object. Revit object geometry is used to generate geometry of the exported ACA object. That may produce better geometric fidelity in some cases.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ACAObjectPreference
```
```vb
Public Enumeration ACAObjectPreference
```
```cpp
public enum class ACAObjectPreference
```
```fsharp
type ACAObjectPreference
```

| Member name | Value | Description |
| --- | --- | --- |
| Geometry | 1 |  |
| Object | 0 |  |

#### Reference

Autodesk.Revit.DB Namespace